In [2]:
!pip install pandas
import pandas as pd
!pip install pylint

Requirement already satisfied: pandas in c:\users\91766\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\91766\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\91766\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\91766\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\91766\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\91766\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Requirement already satisfied: pylint in c:\users\91766\anaconda3\lib\site-packages (2.16.2)
Requirement already satisfied: platformdirs>=2.2.0 in c:\users\91766\anaconda3\lib\site-packages (from pylint) (3.10.0)
Requirement already satisfied: astroid<=2.16.0-dev0,>=2.14.2 in c:\users\91766\anaconda3\lib\site-packages (from pylint) (2.14.2)
Requirement already satisfied: isort<6,>=4.2.5 in c:\users\91766\anaconda3\lib\site-packages (from pylint) (5.9.3)
Requirement already satisfied: mccabe<0.8,>=0.6 in c:\users\91766\anaconda3\lib\site-packages (from pylint) (0.7.0)
Requirement already satisfied: tomlkit>=0.10.1 in c:\users\91766\anaconda3\lib\site-packages (from pylint) (0.11.1)
Requirement already satisfied: dill>=0.3.6 in c:\users\91766\anaconda3\lib\site-packages (from pylint) (0.3.6)
Requirement already satisfied: colorama>=0.4.5 in c:\users\91766\anaconda3\lib\site-packages (from pylint) (0.4.6)
Requirement already satisfied: lazy-object-proxy>=1.4.0 in c:\users\91766\anaconda3\lib\site-packages (from astroid<=2.16.0-dev0,>=2.14.2->pylint) (1.6.0)
Requirement already satisfied: wrapt<2,>=1.14 in c:\users\91766\anaconda3\lib\site-packages (from astroid<=2.16.0-dev0,>=2.14.2->pylint) (1.14.1)

In [3]:
import numpy as np
# np.arrange([1,2,3,4,5])
a=np.array([[1,2,3],[4,5,6]])
a
# a.shape

array([[1, 2, 3],
       [4, 5, 6]])

In [4]:
a[1,1]

5

In [5]:
a.ndim

2

In [6]:
len(a)

2

In [7]:
import pandas as pd

In [8]:
data = {
    "OrderID": [1001, 1002, 1003, 1004, 1005, 1006],
    "CustomerName": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank"],
    "Product": ["Laptop", "Smartphone", "Laptop", "Monitor", "Tablet", "Laptop"],
    "Category": ["Electronics", "Electronics", "Electronics", "Electronics", "Electronics", "Electronics"],
    "Quantity": [1, 2, 1, 2, 3, 1],
    "PricePerUnit": [800, 500, 900, 300, 200, 850],
    "OrderDate": pd.to_datetime(["2024-03-01", "2024-03-02", "2024-03-03", "2024-03-05", "2024-03-06", "2024-03-06"]),
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "New York"]
}

In [9]:
d=pd.DataFrame(data)
d

,OrderID,CustomerName,Product,Category,Quantity,PricePerUnit,OrderDate,City
0,1001,Alice,Laptop,Electronics,1,800,2024-03-01,New York
1,1002,Bob,Smartphone,Electronics,2,500,2024-03-02,Los Angeles
2,1003,Charlie,Laptop,Electronics,1,900,2024-03-03,Chicago
3,1004,David,Monitor,Electronics,2,300,2024-03-05,Houston
4,1005,Eve,Tablet,Electronics,3,200,2024-03-06,Phoenix
5,1006,Frank,Laptop,Electronics,1,850,2024-03-06,New York

In [10]:
d.dtypes

OrderID                  int64
CustomerName            object
Product                 object
Category                object
Quantity                 int64
PricePerUnit             int64
OrderDate       datetime64[ns]
City                    object
dtype: object

In [11]:
s=d.groupby("City").count()
s

,OrderID,CustomerName,Product,Category,Quantity,PricePerUnit,OrderDate
City,,,,,,,
Chicago,1,1,1,1,1,1,1
Houston,1,1,1,1,1,1,1
Los Angeles,1,1,1,1,1,1,1
New York,2,2,2,2,2,2,2
Phoenix,1,1,1,1,1,1,1

In [12]:
d["OrderID"] = d["OrderID"].astype(int)
op = d[(d["OrderID"] >= 1004) & (d["PricePerUnit"] >= 200)]
op

,OrderID,CustomerName,Product,Category,Quantity,PricePerUnit,OrderDate,City
3,1004,David,Monitor,Electronics,2,300,2024-03-05,Houston
4,1005,Eve,Tablet,Electronics,3,200,2024-03-06,Phoenix
5,1006,Frank,Laptop,Electronics,1,850,2024-03-06,New York

In [13]:

sq=d.columns
sq

Index(['OrderID', 'CustomerName', 'Product', 'Category', 'Quantity',
       'PricePerUnit', 'OrderDate', 'City'],
      dtype='object')

In [14]:
students = {
    "Alice": [85, 90, 78, 92],
    "Bob":[60, 65, 70, 75],
    "Charlie": [40, 45, 50, 55],
    "David":[95, 100, 98, 92]
}

In [15]:
df=pd.DataFrame(students)
df.columns = df.columns.str.strip()

In [16]:
so=df.sort_values(by="PricePerUnit",ascending=True)

KeyError: 'PricePerUnit'

In [ ]:
df.describe()

In [ ]:
df.info()

# The Financial Analystâ€™s Dilemma ðŸ’°

In [ ]:
import numpy as np
import pandas as pd
stock_prices = np.array([
    [120, 340, 450, 220, 310],
    [330, 420, 380, 250, 410],
    [150, 280, 290, 230, 200],
])

print(stock_prices.shape)  # Output: (30, 5)

In [ ]:
d=pd.DataFrame(stock_prices)
d
list=[]
print(len(d))
for i in range(5):
    list.append(np.average(d[i]))
print("Avearage stock prices:",list)

In [ ]:
d

In [ ]:
# for i in range(5):
#     for j in range(len(d)):
m=np.max(d)
mi=np.min(d)
m
mi

In [ ]:
max_pos = np.unravel_index(d.values.argmax(), d.shape)
max_pos

In [ ]:
max_pos = np.unravel_index(d.values.argmax(), d.shape)
company = d.index[max_pos[0]]
date = d.columns[max_pos[1]]
price = d.iloc[max_pos]

print(f"\n  max price was â‚¹{d.loc[company, date]} for {company} on {date}")

In [ ]:
#normalized prices
stock_pr=260

# normalized_prices=()

In [ ]:
# normalized_prices
# normalized_prices=(stock_pr-np.min(d))/(np.max(d)-np.min(d))
# normalized_prices
list=[]
print(len(d))
for i in range(5):
    list.append(np.mean(d[i]))
print("Avearage stock prices:",list)

In [ ]:
# l=[]
# print(d[2][1])
for i in range(5):
    for j in range(len(d)):
        l.append(round(d[i][j]/m,2))

arr = np.array(l).reshape(3, 5)
print("normalized values", arr)

# Challenge 2: The Space Mission Resource Allocation ðŸŒŒ

In [ ]:
resources = np.array([
    [15, 40, 32],
    [20, 42, 35],
    [25, 38, 30],
    [18, 50, 40],
    [22, 37, 36],
    [28, 45, 33]
])

In [ ]:
rd=pd.DataFrame(resources)
rd

In [ ]:
np.sum(rd[0])

In [ ]:
rl=[]

for i in range(3):
    rl.append(np.sum(rd[i]))
print(rl)

In [ ]:
print("Total resources needed (tons): Oxygen: ",rl[0], "Water:", rl[1], "Food:", rl[2])

In [ ]:
stde=[]

for i in range(3):
    stde.append(round(np.std(rd[i]),2))
print("Standard deviation of consumption: Oxygen:",stde[0],"water:",stde[1],"Food:",stde[2])

In [ ]:
transpose_matrix=rd.T
transpose_matrix

In [ ]:
rd

In [ ]:
max=rd[0][0]
month=0
for i in range(3):
    for j in range(len(rd)):
        if rd[i][j]>max:
            max=rd[i][j]
            month=j+1
print("Highest consumption in a month: Water (",max, "tons in month ",month,")")

# Basketball Performance Analyzer ðŸ“Š#

In [ ]:
points = np.array([
    [10, 25, 30, 22, 12, 18, 26, 32, 24, 29],
    [20, 15, 12, 28, 24, 26, 30, 18, 22, 25],
    [35, 30, 32, 40, 28, 34, 29, 31, 26, 37],
    [12, 18, 20, 15, 22, 14, 19, 21, 23, 17],
    [28, 26, 27, 25, 30, 29, 35, 32, 31, 38]
])

In [ ]:
dp=pd.DataFrame(points)
dp
print(dp[3][3])

In [ ]:
data = [
    [10, 25, 30, 22, 12, 18, 26, 32, 24, 29],
    [20, 15, 12, 28, 24, 26, 30, 18, 22, 25],
    [35, 30, 32, 40, 28, 34, 29, 31, 26, 37],
    [12, 18, 20, 15, 22, 14, 19, 21, 23, 17],
    [28, 26, 27, 25, 30, 29, 35, 32, 31, 38]
]


dp = pd.DataFrame(data, columns=[f'{i}' for i in range(10)])
dp

In [ ]:
list=[]
print(len(dp))
for i in range(5):
    list.append(np.mean(dp[i]))
print("Avearage points per game :",list)

In [ ]:
scores=[]
s=dp.T
#for i in range(4):
 #    for j in range(10):
#         print(dp[i][j])
# for i in range(5):
#     scores.append(np.sum(dp[i]))

print(s)

In [ ]:
b=np.sum(s)
print(b)
sort_list=[]
sort_list.append(np.sort(b)[::-1])
print(sort_list[0])

In [ ]:
h=0
l=b[0]
for i in range(5):
    if b[i]>h:
        h=b[i]
        player=i+1
    if b[i]<l:
        l=b[i]
        wplayer=i+1

print("Best-performing player: Player", player, " (Total: ",h, "points)")
print("Worst-performing player: Player", wplayer, " (Total: ",l, "points)")

In [ ]:
# pos=-1
# print(sort_list[0])
# for i in range(5):
scores_above=[]
count=0
for i in range(5):
    if s[i]>30:
        count+=1
        scores_above.append(count)
        print("Player", i,": Games [",count,"]")

In [ ]:
np.zeros((2,2))
np.ones((2,6))

# Employee Salary Insights

In [18]:
data = {
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Emma', 'Frank', 'Grace', 'Hannah'],
    'Department': ['HR', 'IT', 'IT', 'HR', 'Finance', 'Finance', 'IT', 'HR'],
    'Age': [25, 32, 29, 41, 37, 45, 26, 38],
    'Salary': [50000, 70000, 65000, 80000, 75000, 90000, 62000, 85000],
    'Experience': [2, 7, 5, 15, 10, 20, 3, 12]
}
e=pd.DataFrame(data)
e

  Employee Department  Age  Salary  Experience
0    Alice         HR   25   50000           2
1      Bob         IT   32   70000           7
2  Charlie         IT   29   65000           5
3    David         HR   41   80000          15
4     Emma    Finance   37   75000          10
5    Frank    Finance   45   90000          20
6    Grace         IT   26   62000           3
7   Hannah         HR   38   85000          12

In [19]:
department=e.groupby(by="Department").count()
print(department)

            Employee  Age  Salary  Experience
Department
Finance            2    2       2           2
HR                 3    3       3           3
IT                 3    3       3           3

In [20]:
Avg_Salary=e.groupby("Department")["Salary"].mean()
print(Avg_Salary)

Department
Finance    82500.000000
HR         71666.666667
IT         65666.666667
Name: Salary, dtype: float64

In [21]:
max_salary=e.groupby(["Department","Employee"])["Salary"].max()
max_salary1=e.loc[e.groupby("Department")["Salary"].idxmax()]

print(max_salary1)

  Employee Department  Age  Salary  Experience
5    Frank    Finance   45   90000          20
7   Hannah         HR   38   85000          12
1      Bob         IT   32   70000           7

In [22]:
pos=e.groupby("Department")["Salary"].idxmax()
print(pos)

Department
Finance    5
HR         7
IT         1
Name: Salary, dtype: int64

In [23]:
mul=e.groupby("Department")["Salary"].agg(["min", "max", "mean"])
mul

              min    max          mean
Department
Finance     75000  90000  82500.000000
HR          50000  85000  71666.666667
IT          62000  70000  65666.666667

In [33]:

# print(e[(e["Salary"]>65000) & (e["Experience"]>5)])
e.columns

Index(['Employee', 'Department', 'Age', 'Salary', 'Experience'], dtype='object')

In [35]:
# df['Seniority']=df['Seniority'].apply(lambda X: "Junior" if X<5  "Mid-Level" if <10 else "Senior")
e['Seniority'] = e['Experience'].apply(lambda x: "Junior" if x < 5 else "Mid-Level" if x < 10 else "Senior")
print(e)

  Employee Department  Age  Salary  Experience  Seniority
0    Alice         HR   25   50000           2     Junior
1      Bob         IT   32   70000           7  Mid-Level
2  Charlie         IT   29   65000           5  Mid-Level
3    David         HR   41   80000          15     Senior
4     Emma    Finance   37   75000          10     Senior
5    Frank    Finance   45   90000          20     Senior
6    Grace         IT   26   62000           3     Junior
7   Hannah         HR   38   85000          12     Senior

In [42]:
sort_it=e.sort_values(by='Salary', ascending=False) # Descending order
sort_it.groupby("Department")["Salary"].max()

Department
Finance    90000
HR         85000
IT         70000
Name: Salary, dtype: int64

In [46]:
it_e=e[e["Department"]=="IT"]
it_e.sort_values(by="Salary",ascending=False)

  Employee Department  Age  Salary  Experience  Seniority
1      Bob         IT   32   70000           7  Mid-Level
2  Charlie         IT   29   65000           5  Mid-Level
6    Grace         IT   26   62000           3     Junior

# Analyzing Student Grades

In [49]:
student_data = {
    'Student': ['John', 'Sara', 'Mike', 'Anna', 'David', 'Emily', 'Chris', 'Sophia'],
    'Subject': ['Math', 'Science', 'Math', 'Science', 'Math', 'Science', 'Math', 'Science'],
    'Marks': [85, 72, 90, 65, 78, 88, 92, 55],
    'Attendance': [92, 80, 95, 70, 85, 90, 97, 60]
}
student_d=pd.DataFrame(student_data)
student_d

  Student  Subject  Marks  Attendance
0    John     Math     85          92
1    Sara  Science     72          80
2    Mike     Math     90          95
3    Anna  Science     65          70
4   David     Math     78          85
5   Emily  Science     88          90
6   Chris     Math     92          97
7  Sophia  Science     55          60

In [50]:
student_d.groupby("Subject")["Marks"].mean()

Subject
Math       86.25
Science    70.00
Name: Marks, dtype: float64

In [58]:
filtered=student_d[(student_d["Attendance"]<90) & (student_d["Marks"])]
print(filtered)

  Student  Subject  Marks  Attendance
3    Anna  Science     65          70
7  Sophia  Science     55          60

In [60]:
student_d["Grade"]=student_d["Marks"].apply(lambda x: "A" if x>=90 else "B" if(x>=80 & x<90) else "c" if (x>=70 & x<80) else "D" )
print(student_d)

  Student  Subject  Marks  Attendance Grade
0    John     Math     85          92     B
1    Sara  Science     72          80     B
2    Mike     Math     90          95     A
3    Anna  Science     65          70     B
4   David     Math     78          85     B
5   Emily  Science     88          90     B
6   Chris     Math     92          97     A
7  Sophia  Science     55          60     B

In [67]:
student_d.groupby("Grade")["Student"].count()
# student_d.columns

Grade
A    2
B    6
Name: Student, dtype: int64

In [74]:
# student_d[["Marks","Attendance"].corr()

correlation=student_d[["Marks", "Attendance"]].corr()
relationship=correlation.loc["Marks","Attendance"]

In [75]:
if relationship>0:
    print("Stongly effecting ")
elif relationship<0:
    print("No Effect")
else:
    print("No reletionship among them")

Stongly effecting

# filehandling,json and logging

In [ ]:
import logging

# Set the level and format of logs
logging.basicConfig(level=logging.INFO)

logging.info("Program started")
logging.warning("This is a warning")
logging.error("Something went wrong")

In [ ]:
logging.basicConfig(filename="app.log", level=logging.INFO)
logging.info("Program started")
logging.warning("This is a warning")
logging.error("Something went wrong")

In [ ]:
import json
employee = {
    "name": "CK",
    "department": {
        "name": "Engineering",
        "location": "Hyderabad"
    },
    "projects": [
        {"title": "Contact App", "status": "Completed"},
        {"title": "Game UI", "status": "Ongoing"}
    ]
}

In [ ]:
json_string = json.dumps(employee, indent=2)

In [ ]:
print(json_string)

In [ ]:
import pylint
pylint exception1.py

In [ ]:
python min_max_matrix.py